app/controllers/admin/customers_controller.rb

  def update
    @customer = Customer.find(params[:id])
    if @customer.update(customer_params)
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "customers" SET "first_name" = ?, "last_name" = ?, "first_name_kana" = ?, "last_name_kana" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["first_name", "山田"], ["last_name", "太郎"], ["first_name_kana", "ヤマダ"], ["last_name_kana", "タロウ"], ["updated_at", "2020-12-03 09:46:14.177119"], ["id", 1]]