app/controllers/admin/genres_controller.rb

INSERT INTO "genres" ("name", "is_active", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "ミルクティ"], ["is_active", 0], ["created_at", "2020-12-03 02:05:30.906032"], ["updated_at", "2020-12-03 02:05:30.906032"]]
SELECT "genres".* FROM "genres"
---
  def create
    @genre = Genre.new(genre_params)
    #binding.pry
    if @genre.save
      redirect_to admin_genres_path
    else
      @genres = Genre.all

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "genres" SET "name" = ?, "is_active" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["name", "ミルクティ2"], ["is_active", 1], ["updated_at", "2020-12-03 02:05:43.633131"], ["id", 13]]
---
  def update
    @genre = Genre.find(params[:id])
    if @genre.update(genre_params)