app/controllers/admin/orders_controller.rb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "orders".* FROM "orders"
---
    def index
      path = Rails.application.routes.recognize_path(request.referer)
      if path[:controller] == "admin/homes" && path[:action] == "top"
        @orders = Order.where(created_at: Date.today.all_day).page(params[:page]).per(10).reverse_order
      elsif path[:controller] == "admin/customers" && path[:action] == "show" && params.has_key?(:customer_id)
        customer = Customer.find(params[:customer_id])
        @orders = customer.orders.page(params[:page]).per(10).reverse_order

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "order_products".* FROM "order_products" WHERE "order_products"."order_id" = ?  [["order_id", 1]]
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
      @order = Order.find(params[:id])
      @order_products = OrderProduct.where(order_id: @order)
      @customer = Customer.find_by(id: @order.customer_id)