app/controllers/admin/products_controller.rb

  def index
    @products = Product.page(params[:page]).per(10)
---
SELECT  "products".* FROM "products" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products"

  def create
    @product = Product.new(product_params)
    if @product.save
---
INSERT INTO "products" ("genre_id", "name", "introduction", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["genre_id", 1], ["name", "あ"], ["introduction", "あ"], ["price", 1], ["created_at", "2020-12-03 08:29:46.357482"], ["updated_at", "2020-12-03 08:29:46.357482"]]

  def show
    @product = Product.find(params[:id])
    @genre = Genre.find_by(id: @product.genre_id)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @product = Product.find(params[:id])
    if @product.update(product_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "is_active" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["is_active", 0], ["updated_at", "2020-12-03 10:08:40.428653"], ["id", 1]]