app/views/admin/orders/index.html.erb

            </td>
            <td><%= order.customer.last_name %><%= order.customer.first_name %></td>
            <td><%= order.order_products.all.sum(:amount) %></td>
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "orders".* FROM "orders"
SELECT SUM("order_products"."amount") FROM "order_products" WHERE "order_products"."order_id" = ?  [["order_id", 1]]