app/views/admin/orders/show.html.erb

SELECT "order_products".* FROM "order_products" WHERE "order_products"."order_id" = ?  [["order_id", 1]]
---
                  <%= form_with model: order_product, url: admin_order_product_path(order_product), local: true do |f| %>
                    <%= f.select :making_status,OrderProduct.making_statuses.keys %>