app/views/admin/products/edit.html.erb

    <%= f.label :genre_id, "ジャンル" %>
    <%= f.collection_select(:genre_id, Genre.all, :id, :name) %>
---
SELECT "genres".* FROM "genres"