app/views/admin/products/new.html.erb

SELECT "genres".* FROM "genres"
---
          <%= f.label :genre_id, "ジャンル" %>
          <%= f.collection_select :genre_id, Genre.all, :id, :name, prompt: "--選択してください--" %>